<a href="https://colab.research.google.com/github/you0229/kaggle_titanic/blob/master/main.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# google drive mount
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/drive

In [0]:
# library
import pandas as pd 
import numpy as np
from sklearn.ensemble import RandomForestClassifier

In [52]:
# path
train_path = '/content/drive/My Drive/MachineLeaning/kaggle_titanic/train.csv'
test_path = '/content/drive/My Drive/MachineLeaning/kaggle_titanic/test.csv'

# data load
train= pd.read_csv(train_path)
test= pd.read_csv(test_path)

del train_path
del test_path

train.head(3)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[3 rows x 12 columns]

In [53]:
# info
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [54]:
# 性別を0 or 1に変更
# Embarked(搭乗位置)を0 or 1 or 2 に変更
train= train.replace("male",0).replace("female",1).replace("S",0).replace("C",1).replace("Q",2)
test= test.replace("male",0).replace("female",1).replace("S",0).replace("C",1).replace("Q",2)

display('train', train.head(3))
display('test', test.head(3))

'train'

   PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0            1         0       3  ...   7.2500    NaN       0.0
1            2         1       1  ...  71.2833    C85       1.0
2            3         1       3  ...   7.9250    NaN       0.0

[3 rows x 12 columns]

'test'

   PassengerId  Pclass  ... Cabin  Embarked
0          892       3  ...   NaN         2
1          893       3  ...   NaN         0
2          894       2  ...   NaN         2

[3 rows x 11 columns]

In [55]:
# 欠損値処理
train["Age"].fillna(train.Age.mean(), inplace=True) 
train["Embarked"].fillna(train.Embarked.mean(), inplace=True)

display('train', train.info())
display('test', test.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null int64
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       891 non-null float64
dtypes: float64(3), int64(6), object(3)
memory usage: 83.7+ KB

'train'

None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null int64
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null int64
dtypes: float64(2), int64(6), object(3)
memory usage: 36.0+ KB

'test'

None

In [57]:
# ???
combine1 = [train]

# 正規表現で分割
for train in combine1: 
        display(train.head(5))
        train['Salutation'] = train.Name.str.extract(' ([A-Za-z]+).', expand=False) 
        display(train.head(5))

#  正規化
for train in combine1: 
        train['Salutation'] = train['Salutation'].replace(['Lady', 'Countess','Capt', 'Col','Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'], 'Rare')
        train['Salutation'] = train['Salutation'].replace('Mlle', 'Miss')
        train['Salutation'] = train['Salutation'].replace('Ms', 'Miss')
        train['Salutation'] = train['Salutation'].replace('Mme', 'Mrs')
        del train['Name']
        display(train.head(5))

#  数値に変換
Salutation_mapping = {"Mr": 1, "Miss": 2, "Mrs": 3, "Master": 4, "Rare": 5} 
for train in combine1: 
        train['Salutation'] = train['Salutation'].map(Salutation_mapping) 
        train['Salutation'] = train['Salutation'].fillna(0)
        display(train.head(5))

train.head(3)

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

0      Mr
1     Mrs
2    Miss
3     Mrs
4      Mr
Name: Salutation, dtype: object

0      Mr
1     Mrs
2    Miss
3     Mrs
4      Mr
Name: Salutation, dtype: object

0    1.0
1    3.0
2    2.0
3    3.0
4    1.0
Name: Salutation, dtype: float64

   PassengerId  Survived  Pclass  Sex  ...     Fare  Cabin  Embarked Salutation
0            1         0       3    0  ...   7.2500    NaN       0.0        1.0
1            2         1       1    1  ...  71.2833    C85       1.0        3.0
2            3         1       3    1  ...   7.9250    NaN       0.0        2.0

[3 rows x 12 columns]